#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.compute.google_compute_address.static_ip will be created
  + resource "google_compute_address" "static_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "stargazer-static-ip"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "project-047e45d5-e6f0-4cfa-b86"
      + purpose            = (known after apply)
      + region             = "australia-southeast1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + users              = (known after apply)
    }

  # module.compute.google_compute_instance.app_server will be created
  + resource "google_compute_instance" "app_server" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + creation_timestamp      = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "e2-small"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            #!/bin/bash
            set -euo pipefail
            
            # Install Docker if not present
            if ! command -v docker &> /dev/null; then
              apt-get update
              apt-get install -y \
                  ca-certificates \
                  curl \
                  gnupg \
                  lsb-release
            
              mkdir -p /etc/apt/keyrings
              curl -fsSL https://download.docker.com/linux/debian/gpg | gpg --dearmor -o /etc/apt/keyrings/docker.gpg
            
              echo \
                "deb [arch=$(dpkg --print-architecture) signed-by=/etc/apt/keyrings/docker.gpg] https://download.docker.com/linux/debian \
                $(lsb_release -cs) stable" | tee /etc/apt/sources.list.d/docker.list > /dev/null
            
              apt-get update
              apt-get install -y docker-ce docker-ce-cli containerd.io docker-compose-plugin
            fi
            
            # Create app directory
            mkdir -p /opt/app
            
            # Configure Docker to use gcloud credential helper
            gcloud auth configure-docker australia-southeast1-docker.pkg.dev --quiet
            
            # Fetch all required secrets — abort immediately if any are missing
            PROJECT_ID=$(gcloud config get-value project)
            
            MYSQL_ROOT_PASSWORD=$(gcloud secrets versions access latest --secret="mysql-root-password") \
              || { echo "FATAL: Failed to fetch secret mysql-root-password" >&2; exit 1; }
            
            JWT_SECRET=$(gcloud secrets versions access latest --secret="jwt-secret") \
              || { echo "FATAL: Failed to fetch secret jwt-secret" >&2; exit 1; }
            
            MONGODB_URI=$(gcloud secrets versions access latest --secret="mongodb-uri") \
              || { echo "FATAL: Failed to fetch secret mongodb-uri" >&2; exit 1; }
            
            REDIS_PASSWORD=$(gcloud secrets versions access latest --secret="redis-password") \
              || { echo "FATAL: Failed to fetch secret redis-password" >&2; exit 1; }
            
            cat <<ENV > /opt/app/.env
            PROJECT_ID=$PROJECT_ID
            MYSQL_ROOT_PASSWORD=$MYSQL_ROOT_PASSWORD
            JWT_SECRET=$JWT_SECRET
            MONGODB_URI=$MONGODB_URI
            REDIS_PASSWORD=$REDIS_PASSWORD
            ENV
            
            # If docker-compose.yml exists, start services
            if [ -f "/opt/app/docker-compose.yml" ]; then
              cd /opt/app
              docker compose up -d
            fi
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "stargazer-vm"
      + project                 = "project-047e45d5-e6f0-4cfa-b86"
      + self_link               = (known after apply)
      + tags                    = [
          + "http-server",
          + "https-server",
        ]
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                    = "australia-southeast1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "debian-cloud/debian-11"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = 30
              + snapshot               = (known after apply)
              + type                   = "pd-standard"
            }
        }

      + confidential_instance_config (known after apply)

      + guest_accelerator (known after apply)

      + network_interface {
          + igmp_query                  = (known after apply)
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "stargazer-vpc"
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + parent_nic_name             = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = "stargazer-subnet"
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity (known after apply)

      + scheduling (known after apply)

      + service_account {
          + email  = "vm-service-account@project-047e45d5-e6f0-4cfa-b86.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # module.compute.google_project_iam_member.vm_sa_artifact_reader will be created
  + resource "google_project_iam_member" "vm_sa_artifact_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:vm-service-account@project-047e45d5-e6f0-4cfa-b86.iam.gserviceaccount.com"
      + project = "project-047e45d5-e6f0-4cfa-b86"
      + role    = "roles/artifactregistry.reader"
    }

  # module.compute.google_project_iam_member.vm_sa_log_writer will be created
  + resource "google_project_iam_member" "vm_sa_log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:vm-service-account@project-047e45d5-e6f0-4cfa-b86.iam.gserviceaccount.com"
      + project = "project-047e45d5-e6f0-4cfa-b86"
      + role    = "roles/logging.logWriter"
    }

  # module.compute.google_project_iam_member.vm_sa_metric_writer will be created
  + resource "google_project_iam_member" "vm_sa_metric_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:vm-service-account@project-047e45d5-e6f0-4cfa-b86.iam.gserviceaccount.com"
      + project = "project-047e45d5-e6f0-4cfa-b86"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.compute.google_project_iam_member.vm_sa_secret_accessor will be created
  + resource "google_project_iam_member" "vm_sa_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:vm-service-account@project-047e45d5-e6f0-4cfa-b86.iam.gserviceaccount.com"
      + project = "project-047e45d5-e6f0-4cfa-b86"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.compute.google_service_account.vm_sa will be created
  + resource "google_service_account" "vm_sa" {
      + account_id   = "vm-service-account"
      + disabled     = false
      + display_name = "VM Service Account"
      + email        = "vm-service-account@project-047e45d5-e6f0-4cfa-b86.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:vm-service-account@project-047e45d5-e6f0-4cfa-b86.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "project-047e45d5-e6f0-4cfa-b86"
      + unique_id    = (known after apply)
    }

  # module.networking.google_compute_firewall.allow_http_https will be created
  + resource "google_compute_firewall" "allow_http_https" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-http-https"
      + network            = "stargazer-vpc"
      + priority           = 1000
      + project            = "project-047e45d5-e6f0-4cfa-b86"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "http-server",
          + "https-server",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # module.networking.google_compute_firewall.allow_internal will be created
  + resource "google_compute_firewall" "allow_internal" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-internal"
      + network            = "stargazer-vpc"
      + priority           = 1000
      + project            = "project-047e45d5-e6f0-4cfa-b86"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.1.0/24",
        ]

      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "udp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # module.networking.google_compute_firewall.allow_ssh_iap will be created
  + resource "google_compute_firewall" "allow_ssh_iap" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-ssh-iap"
      + network            = "stargazer-vpc"
      + priority           = 1000
      + project            = "project-047e45d5-e6f0-4cfa-b86"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "35.235.240.0/20",
        ]
      + target_tags        = [
          + "http-server",
          + "https-server",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # module.networking.google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_bgp_always_compare_med             = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "stargazer-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "project-047e45d5-e6f0-4cfa-b86"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.networking.google_compute_subnetwork.subnet will be created
  + resource "google_compute_subnetwork" "subnet" {
      + allow_subnet_cidr_routes_overlap = (known after apply)
      + creation_timestamp               = (known after apply)
      + external_ipv6_prefix             = (known after apply)
      + fingerprint                      = (known after apply)
      + gateway_address                  = (known after apply)
      + id                               = (known after apply)
      + internal_ipv6_prefix             = (known after apply)
      + ip_cidr_range                    = "10.0.1.0/24"
      + ipv6_cidr_range                  = (known after apply)
      + ipv6_gce_endpoint                = (known after apply)
      + name                             = "stargazer-subnet"
      + network                          = (known after apply)
      + private_ip_google_access         = (known after apply)
      + private_ipv6_google_access       = (known after apply)
      + project                          = "project-047e45d5-e6f0-4cfa-b86"
      + purpose                          = (known after apply)
      + region                           = "australia-southeast1"
      + self_link                        = (known after apply)
      + stack_type                       = (known after apply)
      + state                            = (known after apply)
      + subnetwork_id                    = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # module.scheduler.google_cloud_scheduler_job.start_vm will be created
  + resource "google_cloud_scheduler_job" "start_vm" {
      + description = "Start VM at 7 AM Sydney time"
      + id          = (known after apply)
      + name        = "start-vm-job"
      + paused      = (known after apply)
      + project     = "project-047e45d5-e6f0-4cfa-b86"
      + region      = "australia-southeast1"
      + schedule    = "0 7 * * *"
      + state       = (known after apply)
      + time_zone   = "Australia/Sydney"

      + http_target {
          + http_method = "POST"
          + uri         = "https://compute.googleapis.com/compute/v1/projects/project-047e45d5-e6f0-4cfa-b86/zones/australia-southeast1-b/instances/stargazer-vm/start"

          + oauth_token {
              + service_account_email = "scheduler-sa@project-047e45d5-e6f0-4cfa-b86.iam.gserviceaccount.com"
            }
        }
    }

  # module.scheduler.google_cloud_scheduler_job.stop_vm will be created
  + resource "google_cloud_scheduler_job" "stop_vm" {
      + description = "Stop VM at 11 PM Sydney time"
      + id          = (known after apply)
      + name        = "stop-vm-job"
      + paused      = (known after apply)
      + project     = "project-047e45d5-e6f0-4cfa-b86"
      + region      = "australia-southeast1"
      + schedule    = "0 23 * * *"
      + state       = (known after apply)
      + time_zone   = "Australia/Sydney"

      + http_target {
          + http_method = "POST"
          + uri         = "https://compute.googleapis.com/compute/v1/projects/project-047e45d5-e6f0-4cfa-b86/zones/australia-southeast1-b/instances/stargazer-vm/stop"

          + oauth_token {
              + service_account_email = "scheduler-sa@project-047e45d5-e6f0-4cfa-b86.iam.gserviceaccount.com"
            }
        }
    }

  # module.scheduler.google_project_iam_member.scheduler_compute_admin will be created
  + resource "google_project_iam_member" "scheduler_compute_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:scheduler-sa@project-047e45d5-e6f0-4cfa-b86.iam.gserviceaccount.com"
      + project = "project-047e45d5-e6f0-4cfa-b86"
      + role    = "roles/compute.instanceAdmin.v1"
    }

  # module.scheduler.google_service_account.scheduler_sa will be created
  + resource "google_service_account" "scheduler_sa" {
      + account_id   = "scheduler-sa"
      + disabled     = false
      + display_name = "Cloud Scheduler Service Account"
      + email        = "scheduler-sa@project-047e45d5-e6f0-4cfa-b86.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:scheduler-sa@project-047e45d5-e6f0-4cfa-b86.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "project-047e45d5-e6f0-4cfa-b86"
      + unique_id    = (known after apply)
    }

  # module.secrets.google_secret_manager_secret.secrets["jwt-secret"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "project-047e45d5-e6f0-4cfa-b86"
      + secret_id             = "jwt-secret"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secrets.google_secret_manager_secret.secrets["mongodb-uri"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "project-047e45d5-e6f0-4cfa-b86"
      + secret_id             = "mongodb-uri"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secrets.google_secret_manager_secret.secrets["mysql-root-password"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "project-047e45d5-e6f0-4cfa-b86"
      + secret_id             = "mysql-root-password"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secrets.google_secret_manager_secret.secrets["next-public-api-url"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "project-047e45d5-e6f0-4cfa-b86"
      + secret_id             = "next-public-api-url"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secrets.google_secret_manager_secret.secrets["redis-password"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "project-047e45d5-e6f0-4cfa-b86"
      + secret_id             = "redis-password"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_external_ip   = (known after apply)
  + vm_instance_name = "stargazer-vm"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>